Revit 2024 API
AnalyticalPowerSourceData Properties
The AnalyticalPowerSourceData type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AnalyticalDistributionNodePropertyData.)
NumberOfPhases
 The number of phases.
 (Inherited from AnalyticalDistributionNodePropertyData.)
TotalConnectedCurrent
 The total connected current of the analytical power source.
Voltage
 The voltage value of the analytical power source.
See Also
AnalyticalPowerSourceData Class
Autodesk.Revit.DB.Electrical Namespace